Repository: bestwebsoft/Google-Shortlink
Catalog: languages/google-shortlink-*.po
Languages: ru_ru

source: Shortlink Settings
ru_ru: Настройки Shortlink

source: Settings
ru_ru: Настройки

source: Do you really want to delete all links from database?
ru_ru: Вы действительно хотите удалить все ссылки из базы данных?

source: Replacing long links with short...
ru_ru: Заменяем длинные ссылки на короткие...

source: Replace short links to long...
ru_ru: Заменяем короткие ссылки на длинные...

source: Restoring all links and deleting them from the database
ru_ru: Восстанавливаем все ссылки и удаляем их из базы данных...

source: Scanning website....
ru_ru: Сканируем вебсайт....

source: more details
ru_ru: подробнее

source: All long links from the database have been restored and the database has been cleared.
ru_ru: Все длинные ссылки из базы данных были восстановлены и база данных была очищена.

source: All long links from the database have been restored.
ru_ru: Все длинные ссылки из базы данных были восстановлены.

source: Total replaces:
ru_ru: Всего замен:

source: All links from the database have been replaced.
ru_ru: Все ссылки из базы данных были заменены.

source: Error:
ru_ru: Ошибка:

source: %s link failed:
ru_ru: %s ошибка при добавлении ссылки:

source: Website has been scanned.
ru_ru: Cайт был просканирован.

source: links were added to database.
ru_ru: ссылки были добавлены в базу данных.

source: There are no new links.
ru_ru: Новых ссылок не обнаружено.

source: The list of articles has been updated for each link.
ru_ru: Список статей был обновлен для каждой ссылки.

source: Yes, update to Firebase
ru_ru: Да, обновить

source: No, go back to the settings page
ru_ru: Нет, вернутся на страницу настроек

source: Please fill all settings and log in to your Google Account
ru_ru: Пожалуйста, заполните все настройки и войдите в свой аккаунт Google

source: Log in to your Google Account
ru_ru: Войти в свой аккаунт Google

source: no title
ru_ru: без названия

source: None
ru_ru: Нет

source: Wait for response
ru_ru: Ждем ответа

source: link
ru_ru: ссылка

source: links
ru_ru: ссылки

source: Long Link
ru_ru: Длинная ссылка

source: Short Link
ru_ru: Короткая ссылка

source: Total Clicks
ru_ru: Всего переходов

source: Articles That Contain Links
ru_ru: Статьи, которые содержат ссылки

source: Replace
ru_ru: Заменить

source: Restore
ru_ru: Восстановить

source: Delete
ru_ru: Удалить

source: Table of Links for Shortener API
ru_ru: Таблица cсылок для Shortener API

source: Table of links for Firebase Dynamic Links
ru_ru: Таблица Ссылок для Firebase Dynamic Links

source: Direct Input
ru_ru: Прямой ввод

source: Additional Options
ru_ru: Дополнительные опции

source: Please enable JavaScript to count total clicks.
ru_ru: Пожалуйста, включите JavaScript, чтобы узнать общее число кликов.

source: One long link was replaced with a short link.
ru_ru: Одна длинная ссылка была заменена на короткую.

source: One short link was restored to a long link.
ru_ru: Одна короткая ссылка была заменена на длинную.

source: One short link was deleted from database.
ru_ru: Одна короткая ссылка была удалена из базы данных.

source: Warning:
ru_ru: Внимание:

source: You haven't entered API key yet. Go to plugin's
ru_ru: Вы еще не ввели ключ API. Перейдите на страницу

source: settings page
ru_ru: настроек плагина

source: and enter your key.
ru_ru: и введите ваш ключ.

source: Notice:
ru_ru: Внимание:

source: Click statistic updates every 3 days
ru_ru: Статистика обновляется каждые 3 дня

source: Total %d links have been replaced
ru_ru: Всего %d ссылок было заменено

source: Total %d links have been restored
ru_ru: Всего %d ссылок было востановлено

source: Total %d links have been deleted from database
ru_ru: Всего %d ссылок было удалено из базы данных

source: There are no links in the database. Go to the Additional options tab, and scan your website.
ru_ru: В базе данных не содержится ссылок. Перейдите во вкладку "Дополнительные опции", и просканируйте ваш вебсайт.

source: Invalid API key. Go to plugin's
ru_ru: Некорректный API ключ. Перейдите на страницу

source: and enter correct key.
ru_ru: и введите корректный ключ.

source: There are empty fields on the page. Fill them out before adding another one.
ru_ru: На странице остались пустые поля. Заполните их перед добавлением еще одного.

source: Get Short Links By Direct Input:
ru_ru: Получить короткие ссылки путем прямого ввода:

source: Type long links here:
ru_ru: Вводите длинные ссылки сюда:

source: Short links will appear below:
ru_ru: Короткие ссылки появятся ниже:

source: Get Short Links
ru_ru: Получить короткие ссылки

source: Reset Form
ru_ru: Очистить форму

source: Add Field
ru_ru: Добавить поле

source: Actions with Links:
ru_ru: Действия cо cсылками:

source: Scan website for new external links
ru_ru: Сканировать вебсайт в поисках новых внешних ссылок

source: Automatically replace all external links
ru_ru: Автоматически заменить все внешние ссылки

source: Automatically restore all external links
ru_ru: Автоматически восстановить все внешние ссылки

source: Restore all links and clear the database
ru_ru: Восстановить все ссылки и очистить базу данных

source: Apply
ru_ru: Применить

source: No statistic for this link
ru_ru: Нет статистики для этой ссылки

source: Request had invalid authentication credentials
ru_ru: Запрос с неверными учетными данными

source: We could not match link with whitelisted URL patterns in your Google project
ru_ru: Ссылка не совпадает с шаблонами URL из белого списка в вашем Google проекте

source: Bad request error.
ru_ru: Плохой запрос.

source: Invalid API key error.
ru_ru: Некорректный ключ API.

source: Error with access not configuration.
ru_ru: Ошибка "Доступ не настроен".

source: Expired API key error.
ru_ru: Ошибка "Иcтёкший ключ API"

source: Curl error. Please try again.
ru_ru: Ошибка curl. Пожалуйста, попробуйте снова.

source: This hosting does not support СURL.
ru_ru: Это хостинг не поддерживает СURL.

source: Unknown error occurred.
ru_ru: Возникла неизвестная ошибка.

source: FAQ
ru_ru: Часто задаваемые вопросы

source: Support
ru_ru: Поддержка

source: Misc
ru_ru: Разное

source: Custom Code
ru_ru: Пользовательский код

source: Settings saved.
ru_ru: Настройки сохранены.

source: Incorrect API key entered
ru_ru: Введен некорректный ключ API

source: Incorrect data entered.
ru_ru: Введены неверные данные.

source: You must fill all fields.
ru_ru: Неоходимо заполнить все поля.

source: Google API Console
ru_ru: Консоль Google API

source: Update to Firebase API
ru_ru: Обновить до Firebase API

source: Due to Google turning down support for goo.gl URL shortener api from %s.
ru_ru: В связи с тем, что Google отказался от поддержки API goo.gl URL shortener начиная %s.

source: API Key For Your goo.gl Account
ru_ru: Ключ API для вашего аккаунта goo.gl

source: To get API key you should go to
ru_ru: Чтобы получить ключ API, вам нужно перейти на

source: Create project there and insert public API key above.
ru_ru: Создайте там проект и вставьте публичный API ключ выше.

source: API Key For Your Firebase Dynamic Links Account
ru_ru: Ключ API для аккаунта Firebase Dynamic Links

source: Don't know how to get API key? Follow this instruction -
ru_ru: Не знаете, как получить ключ API? Следуйте этой инструкции -

source: Client ID
ru_ru: ID клиента

source: Client Secret
ru_ru: Secret клиента

source: Redirect URI
ru_ru: URI переадресации

source: Copy this link and go to your
ru_ru: Скопируйте эту ссылку и перейдите в

source: Domain Link for your google project
ru_ru: Domain Link для вашего проекта

source: General
ru_ru: Общее

source: Show Links In Table Per Page
ru_ru: Количество ссылок в таблице на одной странице

source: All
ru_ru: Все
